<template>
  <v-row justify="center">
		<v-expansion-panels inset>
			<v-expansion-panel
				v-for="guide in guides"
				:key="guide.title"
			>
				<v-expansion-panel-header :id="guide.id" class="px-auto">
					<v-spacer />
          {{ guide.title }}
          <v-spacer />
				</v-expansion-panel-header>
				<v-expansion-panel-content class="px-auto justify-center">
          <v-spacer />
          <v-row>
            <v-col cols="12">
              <v-btn
                v-if="guide.title === 'วิธีสมัครสมาชิก'"
                color="info"
                block
                rounded
                @click.stop="dialog1 = true"
              >
                ดูตัวอย่าง คลิก!
              </v-btn>
              <v-btn
                v-if="guide.title === 'วิธีแจ้งโอนเงิน'"
                color="info"
                block
                rounded
                @click.stop="dialog2 = true"
              >
                ดูตัวอย่าง คลิก!
              </v-btn>
              <v-dialog
                v-model="dialog1"
                max-width="460"
              >
                <v-card light>
                  <v-img
                    src="https://res.cloudinary.com/dzre5cq2d/image/upload/v1657997467/public/register_qzkrgj.png"
                    class="ma-auto"
                    height="auto"
                  ></v-img>
                  <v-card-actions>
                    <v-btn
                      color="error"
                      block
                      @click="dialog1 = false"
                    >
                      ปิด
                    </v-btn>
                  </v-card-actions>
                </v-card>
              </v-dialog>
              <v-dialog
                v-model="dialog2"
                max-width="460"
              >
                <v-card light>
                  <v-img
                    src="https://res.cloudinary.com/dzre5cq2d/image/upload/v1658316442/public/neworder_joxrqz.png"
                    class="ma-auto"
                    height="auto"
                  ></v-img>
                  <v-card-actions>
                    <v-btn
                      color="error"
                      block
                      @click="dialog2 = false"
                    >
                      ปิด
                    </v-btn>
                  </v-card-actions>
                </v-card>
              </v-dialog>
            </v-col>
          </v-row>
          <v-row>
					  <v-col cols="12" pt-2>
							<v-container fluid>
							  <v-row
								  v-for="list in guide.lists"
									:key="list.number"
									class="my-1"
									justify="start"
								>
								  <v-col
									  cols="2"
										align="end"
										class="col-sm-2 col-md-1 col-lg-1"
									>
									  {{ list.number }}
									</v-col>
									<v-col
									  cols="10"
										align="start"
										class="col-sm-10 col-md-11 col-lg-11 pr-2"
									>
									  {{ list.text }}
										<nuxt-link
										  v-if="list.to"
											:to="list.to"
										>
										  {{ list.title }}
										</nuxt-link>
									</v-col>
								</v-row>
							</v-container>
						</v-col>
					</v-row>
				</v-expansion-panel-content>
			</v-expansion-panel>
		</v-expansion-panels>
	</v-row>
</template>

<script>
export default {
	name: 'GuidesComponent',

	data () {
		return {
      dialog1: false,
      dialog2: false,
			guides: [
				{
					id: 'guide-register',
					title: 'วิธีสมัครสมาชิก',
          lists: [
						{
							number: '1',
							title: 'สมัครสมาชิก',
							text: 'เมนูด้านล่างกดเลือกเมนู ',
							to: '/register'
						},
						{
							number: '2',
							text: 'ป้อนอีเมลล์ที่ใช้สมัคร ต้องเป็นอีเมลล์ที่ไม่เคยใช้สมัครสมาชิกกับเรามาก่อน และต้องสามารถรับลื้งยืนยีนที่ทางระบบจะส่งให้ท่านในขั้นตอนของการยืนยันอีเมลล์หลังจากนี้ได้'
						},
						{
							number: '3',
							text: 'ป้อนรหัสผ่าน 8-20 ตัวอักษร โดยต้องประกอบปด้วย ตัวอักษรภาษาอังกฤษพิมพ์ใหญ่, พิมพ์เล็ก และ ตัวเลข'
						},
						{
							number: '4',
							text: 'ป้อนชื่อ และ นามสกุล (ภาษาไทย) ของผู้สมัคร ต้องตรงกับชื่อบนบัตรประชาชนและบัญชีธนาคาร โดย 1 ชื่อ-นามสกุลสามารถสมัครได้ 1 บัญชีผู้ใช้เท่านั้น'
						},
						{
							number: '5',
							text: `ป้อนหมายเลขโทรศัพท์มือถือ 10 หลัก โดยต้องเป็นเบอร์ที่ไม่เคยใช้สมัครมาก่อน 
							และต้องสามารถรับข้อความ sms ได้ในขั้นตอนของการยืนยันตัวตนหลังจากนี้`
						},
						{
							number: '6',
							text: 'โปรดตรวจสอบข้อมูลให้ถูกต้องก่อนที่จะกดปุ่มสมัครสมาชิก ท่านจะไม่สามารถแก้ไขข้อมูลได้หลังจากส่งข้อมูลแล้ว'
						},
						{
							number: '7',
							text: `หลังจากที่ท่านสมัครสมาชิกสำเร็จแล้ว ท่านต้องทำการยืนยันยัวตนให้เรียบร้อย
							ก่อนจึงจะสามรถใช้บริการได้ ดูสถานะบัญชีของท่านได้ที่ศูนย์สมาชิก`
						},
						{
							number: '8',
							text: 'ดู้รายละเอียดเพิ่มเติมได้ในหัวข้อ "ข้อตกลงในการใช้บริการ" และ "ข้อกำหนดทางกฎหมาย"'
						}
					]
				},
				{
					id: 'guide-neworder',
					title: 'วิธีแจ้งโอนเงิน',
					lists: [
						{
							number: '1',
							title: 'อัตราแลกเปลี่ยน',
							text: 'โปรดตรวจสอบราคาซื้อขายก่อนทุกครั้ง ดูเพิ่มเติมได้ที่หน้า ',
							to: '/currencies'
						},
						{
							number: '2',
							title: 'ติดต่อเรา',
							text: 'ติดต่อเจ้าหน้าที่เพื่อขอรายละเอียดสำหรับโอนเงินเพื่อซื้อหรือโอนดอลลาร์เพื่อขาย ดูช่องทางติดต่อสอบถามได้ที่หน้า  ',
							to: '/contact'
						},
						{
							number: '3',
              title: 'แจ้งโอน',
							text: 'หลังจากโอนเงินหรือดอลลาร์มายังระบบแล้ว โปรดทำการแจ้งโอนเงินได้ที่หน้า ',
              to: '/neworder'
						},
						{
							number: '4',
							text: 'เลือกบริการที่ท่านต้องการแจ้งโอน เช่น หากท่านต้องการขายดอลลาร์หรือแลกเปลี่ยนดอลลาร์เป็นเงินบาท ท่านต้องเลือก "แจ้งโอนเพื่อขาย" เป็นต้น'
						},
						{
							number: '5',
							text: 'เลือกช่องทาง'
						},
						{
							number: '6',
							text: 'ป้อนจำนวนดอลลาร์ที่ท่านต้องการซื้อหรือขาย (ขั้นต่ำ 100 และ สูงสุด 10,000)'
						},
						{
							number: '7',
							text: 'ระบบจะแสดงอัตราแลกเปลี่ยนและราคารวมอัตโนมัติ'
						},
						{
							number: '8',
							text: 'อัปโหลดภาพสลิปหรือหลักฐานการโอน'
						},
						{
							number: '9',
							title: 'ประวัติ',
							text: 'หลังจากกดปุ่มแจ้งโอนเสร็จ ระบบจะแสดงหน้าประวัติบันทึกการซื้อขายโดยอีตโนมีติ หรือไปที่หน้า ',
							to: '/orders'
						},
						{
							number: '10',
							text: 'หลังจากการแจ้งโอนเงิน กรุณารอเจ้าหน้าที่ตรวจสอบและดำเนินการ อาจใช้เวลาประมาณ 20-30 นาที (ดูข้อมูลเพิ่มเติมได้ในหัวข้อ "ข้อตกลงในการใช้บริการ")'
						},
						{
							number: '11',
							text: `ท่านต้องเป็นสมาชิกที่มีสถานะบัญชีเป็น "ยืนยันตัวตนแล้ว" เท่านั้น
								หากยังไม่ใช่โปรดทำการสมัครสมาชิกและทำการยืนยันตัวตนให้เรียบร้อยก่อน
								(ดูรายละเอียดเพิ่มเติมได้ที่ ข้อตกลงในการใช้บริการ,ข้อกำหนดทางกฎหมาย)`
						}
					]
				},
				{
					id: 'guide-policy',
					title: 'ข้อกำหนดทางกฎหมาย',
					lists: [
						{
							number: '1',
							text: 'This is the list 1 of How to verify email'
						},
						{
							number: '2',
							text: 'This is the list 2 of How to verify email'
						},
						{
							number: '3',
							text: 'This is the list 3 of How to verify email'
						}
					]
				},
				{
					id: 'guide-terms',
					title: 'ข้อตกลงในการใช้บริการ',
					lists: [
						{
							number: '1',
							text: `สำหรับการสมัครสมาชิก ทุกข้อมูลที่ใช้สมัครสมาชิกและยืนยันตัวตนจะต้องไม่ซ้ำเด็ดขาด เช่น อีเมลล์, บัตรประจำตัวประชาชน, 
							หมายเลขโทรศัพท์, บัญชีธนาคาร เป็นต้น บริษัทจะพิจรณาตามข้อมูลบนบัตรประชาชนเป็นหลัก ดังนั้น ชื่อ-นามสกุลของผู้สมัคร 
							และ ชื่อเจ้าของบัญชีธนาคาร จะต้องตรงกันกับชื่อ-นามสกุลบนบัตรประจำตัวประชาชนที่ใช้ส่งเป็นหลักฐานในขั้นตอนของการยืนยันตัวตนเท่านั้น 
							โดย 1 หมายเลขประจำตัวประชาชน สามารถสมัครสมาชิกได้แค่ 1 บัญชีผู้ใช้เท่านั้น ทางบริษัทขอสงวนสิทธิ์ในการลบบัญชีผู้ใช้
							ในกรณีที่พบว่าท่านได้สมัครซ้ำหรือมีบัญชีผู้ใช้มากกว่า 1 บัญชีโดยมิต้องแจ้งให้ท่านทราบล่วงหน้า`
						},
						{
							number: '2',
							text: `เนื่องจากนโยบายทางด้านความปลอดภัย บริษัทขอสงวนสิทธิ์ในการให้บริการเฉพาะสมาชิก
							ที่มีสถานะเป็น "ยืนยันตัวตนแล้ว" เท่านั้น`
						},
						{
							number: '3',
							text: `บริษัทขอสงวนสิทฌิ์ในการเแลี่ยนแปลงอัตราแลกเปลี่ยน โดยจะมีการอัพเดตอัตราแลกเปลี่ยน
							ล่าสุดอยู่เสมอ สมาชิกจึงควรตรวจสอบข้อมูลอัตราแลกเปลี่ยนก่อนทำการซื้อขายทุกครั้ง`
						},
						{
							number: '4',
							text: `สำหรับการซื้อ-ขาย สมาชิกต้องใช้บัญชีธนาคารและบัญชีออนไลน์แต่
							ละประเภทที่เป็นชื่อ-นามสกุลเดียวกันกับชื่อ-นามสกุลของสมาชิกเท่านั้น หากไม่ใช่ 
							ทางบริษัทขอสงวนสิทธิ์ในการพิจรณายกเลิกรายการแจ้งโอนนั้นๆเพื่อคืนเงินกลับไปยังบัญชีต้นทาง
							ที่ใช้โอนมาเท่านั้น`
						},
						{
							number: '5',
							text: `การยกเลิกและการขอคืนเงิน สมาชิกต้องติดต่อเจ้าหน้าที่เพื่อแจ้งความประสงค์
							ที่จะขอยกเลิกรายการที่แจ้งโอนมาแล้ว ซึ่งสมาชิกสามารถทำการบกเลิกได้เฉพาะรายการแจ้งโอนที่
							มีสถานะเป็น "รอดำเนินการ" หรือ "กำลังดำเนินการ" เท่านั้น โดยสมาชิกจะได้รับเงินคืนกลับ
							ไปยังบัญชีต้นทางที่สมาชิกใช้โอนเงินมา ทั้งนี้ บริษัทขอสงวนสิทธิ์ในการปฏิเสธการขอเรียกเงินคืน
							สำหรับรายการแจ้งโอนที่มีสถานะเป็น "เรียบร้อยแล้ว" ในทุกกรณี`
						}
					]
				}
			]
		};
	}
};
</script>
